In [ ]:
import pandas as pd
import numpy as np

In [ ]:
# It's perhaps simplest to remember it as 0=down and 1=across.

# This means:
# Use axis=0 to apply a method down each column, or to the row labels (the index).
# Use axis=1 to apply a method across each row, or to the column labels.

 A 2-dimensional array has two corresponding axes: the first running vertically downwards across rows (axis 0), and the second running horizontally across columns (axis 1).  [GOOD]

#### <u> Series </u>

In [ ]:
# Creating a Series

#From a list
arr=[1,2,3]
print("From a list = \n",pd.Series(data=arr))

#From a numpy array
np_arr = np.array([2,3,5])
labels = ['a','b','c']
print("\nFrom a numpy array = \n",pd.Series(data=np_arr, index=labels))


#From a Dictionary
dict={"a":4 ,"b":5, "c":6}
print("\nFrom a Dictionary = \n",pd.Series(dict))

#From indexing
data = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])
print("\n",data)

In [ ]:
""" Understand that python series and Data frame are different
in Series - data["USA"] - (row label) will work
in dataframe - data[row_label] won't work """

#### <u> DataFrames </u>

In [ ]:
df = pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [ ]:
print(df)

Selection and Indexing

In [ ]:
# print Column 
print(df['W'],"\n\n")

#list of column names
print(df[['W','Y']])

Creating new Column

In [ ]:
df["new"] = df["W"] + df["Y"]
print("New table = \n\n",df)

1.Removing Columns

In [ ]:
print('Remove column new\n\n', df.drop('new',axis =1))
# This will not remove the column in original df

In [ ]:
# to remove the columnb in original df 
# Inplace is used
print("Initialy Df = \n\n", df)
df.drop("new",axis=1,inplace=True)
print("\n\nFinally Df = \n\n", df)

2. Removing Rows

In [25]:
print("Orininal data =\n\n" ,df)
print("\n\nremoved row E = \n\n", df.drop("E",axis=0))

Orininal data =

           W         X         Y         Z
A  1.272653  0.016091  0.354749 -0.122991
B  0.035471 -2.111506 -0.735489  2.378155
C -0.438101 -2.147768  2.254576  0.091182
D  1.043364 -1.760529 -1.343725  0.780049
E  3.177951  0.420959 -0.045513 -0.253286


removed row E =

           W         X         Y         Z
A  1.272653  0.016091  0.354749 -0.122991
B  0.035471 -2.111506 -0.735489  2.378155
C -0.438101 -2.147768  2.254576  0.091182
D  1.043364 -1.760529 -1.343725  0.780049

<u> Selecting subset of rows and Columns

In [27]:
# Bth row
# Yth Column

print(df.loc['B','Y'])

-0.7354888147862829

In [28]:
# row = A ,B
# Col = W ,Y
print(df.loc[['A','B'],['W','Y']])

          W         Y
A  1.272653  0.354749
B  0.035471 -0.735489

<u> Missing data

In [30]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [31]:
print("Original =\n\n",df)

Original =

      A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [32]:
# it will drop all the rows where NaN will appear as AXIS =0 is default
print("Drop NaN values = \n\n",df.dropna())

Drop NaN values =

      A    B  C
0  1.0  5.0  1

In [33]:
# it will drop all the Columns where NaN will appear as AXIS =1
print("Drop NaN values = \n\n",df.dropna(axis=1))

Drop NaN values =

    C
0  1
1  2
2  3

In [37]:
# It Fills the Nan value with passed value
df.fillna(value= -101)

       A      B  C
0    1.0    5.0  1
1    2.0 -101.0  2
2 -101.0 -101.0  3

In [38]:
#Combining above
#In column A replace NaN values with its column mean
df['A'].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### <u> Group By </u>

The groupby method allows you to group rows of data together and call aggregate functions

In [41]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

# Creating DataFrame
df=pd.DataFrame(data)
print(df)

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [43]:
# Group by returns an Object
print("Group by Companies\n",df.groupby("Company"))

Group by Companies
 <pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000189B4E27610>

In [44]:
# print Mean of sales per Company
df.groupby("Company").mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [45]:
#STD
df.groupby("Company").std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [46]:
#MIN
df.groupby("Company").min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [47]:
#MAX
df.groupby("Company").max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [48]:
#COUNT
df.groupby("Company").count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [51]:
df.groupby("Company").describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0